BASIC = {
    'дано': 'given:',
    'если': 'given:',
    'найти': 'find:',
    'найдите': 'find:',
    'какой': 'find:',
    'сколько': 'find:',
}

PHYSIC = {
    'расстояние': 'м',
    'длина': 'м',
    'дистанция': 'м',
    'время': 'с',
    'скорость': 'м/с',
    'ускорение': 'м/с**2',
}

PHYSIC_PREFIXES = {
    'мин': (60, 'с'),
    'час': (60 * 60, 'с'),
    'день': (24 * 60 * 60, 'с'),

    'К': (1000, ''),
    'д': (0.1, ''),
    'с': (0.01, ''),

    'Э': (1_000_000_000_000_000_000, ''),
    'П': (1_000_000_000_000_000, ''),
    'Т': (1_000_000_000_000, ''),
    'Г': (1_000_000_000, ''),
    'М': (1_000_000, ''),

    'г': (100, ''),
    'да': (10, ''),

    'м': (0.001, ''),
    'мк': (0.000_001, ''),
    'н': (0.000_000_001, ''),
    'п': (0.000_000_000_001, ''),
    'ф': (0.000_000_000_000_001, ''),
    'а': (0.000_000_000_000_000_001, ''),

}

PHYSIC_MEASURES_NAME = {
    'секунда': 'с',
    'минута': 'мин',
    'метр': 'м',
    'километр': 'Км',
}

SOLVE_FORMULAS = [
    'расстояние = скорость * время',
    'ускорение = скорость / время'
]
