"""Км/час"""
import json



data = {"BASIC": {"дано": "GIVEN", "если": "GIVEN", "за": "GIVEN", "найти": "FIND", "найдите": "FIND", "какой": "FIND", "сколько": "FIND"}, "TITLES": {"расстояние": "м", "время": "с", "ускорение": "м/с**2"}, "PREFIXES": {"К": 1000, "с": 0.01, "м": 0.001}, "PREFIXES_WORDS": {"мин": ["с", 60], "час": ["с", 3600], "день": ["с", 86400]}, "MEASURE_WORD": {"секунда": "с", "минута": "мин", "метр": "м"}, "FORMULAS": ["расстояние = скорость * время", "ускорение = скорость / время"]}
with open('CONFIG.json', 'w') as wfile:
    json.dump(data, wfile)
